# Exercises

### Análise de Dados de Vendas

In [37]:
import pandas as pd

data1 = {
    'Data': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Produto': ['Laptop', 'Telefone', 'Tablet'],
    'Quantidade': [20, 15, 30],
    'Receita': [5000, 3000, 2000]
}

df1 = pd.DataFrame(data1)
df1

         Data   Produto  Quantidade  Receita
0  2023-01-01    Laptop          20     5000
1  2023-01-02  Telefone          15     3000
2  2023-01-03    Tablet          30     2000

In [38]:
# Qual o produto mais vendido?
df1.sort_values(by=['Quantidade'], ascending=False)

         Data   Produto  Quantidade  Receita
2  2023-01-03    Tablet          30     2000
0  2023-01-01    Laptop          20     5000
1  2023-01-02  Telefone          15     3000

In [39]:
# Qual foi o mês com maior volume de vendas?
df1.sort_values(by=['Receita'], ascending=False)

         Data   Produto  Quantidade  Receita
0  2023-01-01    Laptop          20     5000
1  2023-01-02  Telefone          15     3000
2  2023-01-03    Tablet          30     2000

In [40]:
# Qual a média de receita por produto?
receita = df1.groupby('Produto')['Receita'].mean().to_frame()
receita

          Receita
Produto
Laptop     5000.0
Tablet     2000.0
Telefone   3000.0

### Limpeza e Transformação de Dados

In [77]:
data2 = {
    'Nome do Cliente': ['João', 'Maria', 'Carlos', 'Ana'],
    'Idade': [25, None, 30, 22],
    'Valor da Compra': ['R$50,00', 'R$30,00', 'R$40,00', 'R$25,00']
}

df2 = pd.DataFrame(data2) 
df2

  Nome do Cliente  Idade Valor da Compra
0            João   25.0         R$50,00
1           Maria    NaN         R$30,00
2          Carlos   30.0         R$40,00
3             Ana   22.0         R$25,00

In [78]:
# Trate os valores ausentes na coluna 'Idade'.
df2['Idade'] = df2['Idade'].fillna('23.0')
df2

  Nome do Cliente Idade Valor da Compra
0            João  25.0         R$50,00
1           Maria  23.0         R$30,00
2          Carlos  30.0         R$40,00
3             Ana  22.0         R$25,00